; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-19)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl2)
	(at plane2 city9)
	(fuel-level plane2 fl1)
	(at plane3 city12)
	(fuel-level plane3 fl5)
	(at plane4 city0)
	(fuel-level plane4 fl3)
	(at plane5 city13)
	(fuel-level plane5 fl0)
	(at plane6 city10)
	(fuel-level plane6 fl4)
	(at person1 city5)
	(at person2 city14)
	(at person3 city17)
	(at person4 city9)
	(at person5 city20)
	(at person6 city18)
	(at person7 city8)
	(at person8 city19)
	(at person9 city0)
	(at person10 city18)
	(at person11 city16)
	(at person12 city12)
	(at person13 city2)
	(at person14 city7)
	(at person15 city9)
	(at person16 city17)
	(at person17 city6)
	(at person18 city6)
	(at person19 city3)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane2 city20)
	(at plane5 city4)
	(at plane6 city11)
	(at person1 city20)
	(at person2 city15)
	(at person3 city18)
	(at person4 city1)
	(at person5 city0)
	(at person6 city16)
	(at person7 city14)
	(at person8 city3)
	(at person9 city12)
	(at person10 city4)
	(at person11 city10)
	(at person12 city4)
	(at person13 city1)
	(at person14 city10)
	(at person15 city10)
	(at person16 city8)
	(at person17 city16)
	(at person18 city15)
	(at person19 city15)
	))

)

; plan
1. (zoom plane6 city10 city11 fl4 fl3 fl2)
   deleted: (at plane6 city10) (fuel-level plane6 fl4)
   added: (at plane6 city11) (fuel-level plane6 fl2)
   goals met: 2 of 23
2. (refuel plane5 city13 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 2 of 23
3. (fly plane5 city13 city4 fl1 fl0)
   deleted: (at plane5 city13) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 3 of 23
4. (board person9 plane4 city0)
   deleted: (at person9 city0)
   added: (in person9 plane4)
   goals met: 3 of 23
5. (zoom plane4 city0 city12 fl3 fl2 fl1)
   deleted: (at plane4 city0) (fuel-level plane4 fl3)
   added: (at plane4 city12) (fuel-level plane4 fl1)
   goals met: 3 of 23
6. (debark person9 plane4 city12)
   deleted: (in person9 plane4)
   added: (at person9 city12)
   goals met: 4 of 23
7. (board person12 plane3 city12)
   deleted: (at person12 city12)
   added: (in person12 plane3)
   goals met: 4 of 23
8. (zoom plane3 city12 city4 fl5 fl4 fl3)
   deleted: (at plane3 city12) (fuel-level plane3 fl5)
   added: (at plane3 city4) (fuel-level plane3 fl3)
   goals met: 4 of 23
9. (debark person12 plane3 city4)
   deleted: (in person12 plane3)
   added: (at person12 city4)
   goals met: 5 of 23
10. (board person4 plane2 city9)
   deleted: (at person4 city9)
   added: (in person4 plane2)
   goals met: 5 of 23
11. (board person15 plane2 city9)
   deleted: (at person15 city9)
   added: (in person15 plane2)
   goals met: 5 of 23
12. (fly plane2 city9 city1 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 5 of 23
13. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 23
14. (debark person4 plane2 city1)
   deleted: (in person4 plane2)
   added: (at person4 city1)
   goals met: 6 of 23
15. (fly plane2 city1 city10 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 6 of 23
16. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 23
17. (debark person15 plane2 city10)
   deleted: (in person15 plane2)
   added: (at person15 city10)
   goals met: 7 of 23
18. (fly plane2 city10 city20 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city20) (fuel-level plane2 fl0)
   goals met: 8 of 23
19. (board person5 plane2 city20)
   deleted: (at person5 city20)
   added: (in person5 plane2)
   goals met: 8 of 23
20. (refuel plane2 city20 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 23
21. (fly plane2 city20 city0 fl1 fl0)
   deleted: (at plane2 city20) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 7 of 23
22. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 23
23. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   goals met: 8 of 23
24. (fly plane2 city0 city14 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 8 of 23
25. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 23
26. (board person2 plane2 city14)
   deleted: (at person2 city14)
   added: (in person2 plane2)
   goals met: 8 of 23
27. (fly plane2 city14 city15 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 8 of 23
28. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 23
29. (debark person2 plane2 city15)
   deleted: (in person2 plane2)
   added: (at person2 city15)
   goals met: 9 of 23
30. (fly plane2 city15 city16 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 9 of 23
31. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 23
32. (board person11 plane2 city16)
   deleted: (at person11 city16)
   added: (in person11 plane2)
   goals met: 9 of 23
33. (fly plane2 city16 city10 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 9 of 23
34. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 23
35. (debark person11 plane2 city10)
   deleted: (in person11 plane2)
   added: (at person11 city10)
   goals met: 10 of 23
36. (fly plane2 city10 city17 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city17) (fuel-level plane2 fl0)
   goals met: 10 of 23
37. (refuel plane2 city17 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 23
38. (board person3 plane2 city17)
   deleted: (at person3 city17)
   added: (in person3 plane2)
   goals met: 10 of 23
39. (board person16 plane2 city17)
   deleted: (at person16 city17)
   added: (in person16 plane2)
   goals met: 10 of 23
40. (fly plane2 city17 city18 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 10 of 23
41. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 23
42. (board person6 plane2 city18)
   deleted: (at person6 city18)
   added: (in person6 plane2)
   goals met: 10 of 23
43. (debark person3 plane2 city18)
   deleted: (in person3 plane2)
   added: (at person3 city18)
   goals met: 11 of 23
44. (board person10 plane2 city18)
   deleted: (at person10 city18)
   added: (in person10 plane2)
   goals met: 11 of 23
45. (fly plane2 city18 city16 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 11 of 23
46. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 23
47. (debark person6 plane2 city16)
   deleted: (in person6 plane2)
   added: (at person6 city16)
   goals met: 12 of 23
48. (fly plane2 city16 city4 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 12 of 23
49. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 23
50. (debark person10 plane2 city4)
   deleted: (in person10 plane2)
   added: (at person10 city4)
   goals met: 13 of 23
51. (fly plane2 city4 city8 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 13 of 23
52. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 23
53. (board person7 plane2 city8)
   deleted: (at person7 city8)
   added: (in person7 plane2)
   goals met: 13 of 23
54. (debark person16 plane2 city8)
   deleted: (in person16 plane2)
   added: (at person16 city8)
   goals met: 14 of 23
55. (fly plane2 city8 city14 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 14 of 23
56. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 23
57. (debark person7 plane2 city14)
   deleted: (in person7 plane2)
   added: (at person7 city14)
   goals met: 15 of 23
58. (fly plane2 city14 city19 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 15 of 23
59. (refuel plane2 city19 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 15 of 23
60. (board person8 plane2 city19)
   deleted: (at person8 city19)
   added: (in person8 plane2)
   goals met: 15 of 23
61. (fly plane2 city19 city3 fl1 fl0)
   deleted: (at plane2 city19) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 15 of 23
62. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 15 of 23
63. (debark person8 plane2 city3)
   deleted: (in person8 plane2)
   added: (at person8 city3)
   goals met: 16 of 23
64. (board person19 plane2 city3)
   deleted: (at person19 city3)
   added: (in person19 plane2)
   goals met: 16 of 23
65. (fly plane2 city3 city15 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 16 of 23
66. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 23
67. (debark person19 plane2 city15)
   deleted: (in person19 plane2)
   added: (at person19 city15)
   goals met: 17 of 23
68. (fly plane2 city15 city2 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 17 of 23
69. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 23
70. (board person13 plane2 city2)
   deleted: (at person13 city2)
   added: (in person13 plane2)
   goals met: 17 of 23
71. (fly plane2 city2 city1 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 17 of 23
72. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 23
73. (debark person13 plane2 city1)
   deleted: (in person13 plane2)
   added: (at person13 city1)
   goals met: 18 of 23
74. (fly plane2 city1 city20 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city20) (fuel-level plane2 fl0)
   goals met: 19 of 23
75. (zoom plane1 city4 city5 fl2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl2)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 18 of 23
76. (zoom plane3 city4 city6 fl3 fl2 fl1)
   deleted: (at plane3 city4) (fuel-level plane3 fl3)
   added: (at plane3 city6) (fuel-level plane3 fl1)
   goals met: 18 of 23
77. (board person18 plane3 city6)
   deleted: (at person18 city6)
   added: (in person18 plane3)
   goals met: 18 of 23
78. (board person17 plane3 city6)
   deleted: (at person17 city6)
   added: (in person17 plane3)
   goals met: 18 of 23
79. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 18 of 23
80. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   goals met: 18 of 23
81. (fly plane3 city6 city15 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 18 of 23
82. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 18 of 23
83. (debark person18 plane3 city15)
   deleted: (in person18 plane3)
   added: (at person18 city15)
   goals met: 19 of 23
84. (fly plane3 city15 city16 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 19 of 23
85. (debark person17 plane3 city16)
   deleted: (in person17 plane3)
   added: (at person17 city16)
   goals met: 20 of 23
86. (fly plane1 city5 city20 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city20) (fuel-level plane1 fl0)
   goals met: 20 of 23
87. (refuel plane1 city20 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 23
88. (debark person1 plane1 city20)
   deleted: (in person1 plane1)
   added: (at person1 city20)
   goals met: 21 of 23
89. (fly plane1 city20 city4 fl1 fl0)
   deleted: (at plane1 city20) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 22 of 23
90. (fly plane4 city12 city7 fl1 fl0)
   deleted: (at plane4 city12) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 22 of 23
91. (zoom plane6 city11 city7 fl2 fl1 fl0)
   deleted: (at plane6 city11) (fuel-level plane6 fl2)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 21 of 23
92. (refuel plane6 city7 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 21 of 23
93. (board person14 plane6 city7)
   deleted: (at person14 city7)
   added: (in person14 plane6)
   goals met: 21 of 23
94. (fly plane6 city7 city10 fl1 fl0)
   deleted: (at plane6 city7) (fuel-level plane6 fl1)
   added: (at plane6 city10) (fuel-level plane6 fl0)
   goals met: 21 of 23
95. (refuel plane6 city10 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 21 of 23
96. (debark person14 plane6 city10)
   deleted: (in person14 plane6)
   added: (at person14 city10)
   goals met: 22 of 23
97. (fly plane6 city10 city11 fl1 fl0)
   deleted: (at plane6 city10) (fuel-level plane6 fl1)
   added: (at plane6 city11) (fuel-level plane6 fl0)
   goals met: 23 of 23
